def get_galaxy_fold(version, color="black", size=7):
    # version: 폴드폰 버전
    # color: 휴대폰 색상 [입력값이 없으면 기본: black]
    # size: 휴대폰 화면크기(인치) [입력값이 없으면 7인치]
    print(version, color, size)
    
get_galaxy_fold(2)
# 언제써야 되냐? -> 바꾸고 싶은 파라미터가 멀 때

# ------------------------------------
# jlpt 준비, 회화 준비, 쉐도잉, 자기분석
# 인턴 -> 전공
# 수동보다 능동(flask, ai)
# ------------------------------------


# 일본 대학교 가는 법
# 메가벤처 합격
# 2학년 끝
# 일본 대학교 교환학생
# 학점 따라
# f받지 마라


# Parameter
# def bar(d, e=5, a=1, b=2, c=3):
#     print(a, b, c, d, e)
    
# bar(a=1, b=2, c=3, d=4, e=5) # 1

# 함수 정의 부분 함수 호출 부분 나눠서 이해와 생각
# 함수 정의 부분
# 디폴트값을 설정할 수 있다

# 함수 호출 부분
# 필수값만 넣으면 error가 없이 스무스하게 작동시킬 수 있다
# 기본값이 설정되있더라도 바꾸고 싶은 인자를 지정하여 바꿀 수 있다
# 파라미터 값의 순서를 몰라도 변수가 어디에 들어가 있는 지만 알면 호출만으로 값을 바꿀 수 있다
# 순서를 컨트롤할 수 있다
# 파라미터가 100개라면 마지막값 바꿀때 다 작성할래?

# 매개변수가 많음 -> 변경사항은 특정 몇개의 매개변수
# 잘 안바뀌는 부분 -> 키워드 빼기